app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("content", "created_at", "question_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is a great answer to this quesiton"], ["created_at", "2014-12-12 04:24:51.305622"], ["question_id", 1], ["title", "Answer 1"], ["updated_at", "2014-12-12 04:24:51.305622"]]

  def upvote
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:answer_id])

    @answer.vote += 1
    respond_to do |format|
      if @answer.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "answers" SET "updated_at" = $1, "vote" = $2 WHERE "answers"."id" = 1  [["updated_at", "2014-12-12 04:24:54.747198"], ["vote", 1]]

  def downvote
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:answer_id])

    @answer.vote -= 1
    respond_to do |format|
      if @answer.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "answers" SET "updated_at" = $1, "vote" = $2 WHERE "answers"."id" = 1  [["updated_at", "2014-12-12 04:25:05.816374"], ["vote", 1]]