app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all.sort_by(&:created_at).reverse

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @question = Question.find(params[:id])

INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is some content"], ["created_at", "2014-12-11 18:54:17.431391"], ["title", "Test Question 1"], ["updated_at", "2014-12-11 18:54:17.431391"]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "updated_at" = $1, "vote" = $2 WHERE "questions"."id" = 1  [["updated_at", "2014-12-11 18:54:20.390325"], ["vote", 1]]
---
  def upvote
    @question = Question.find(params[:id])

    @question.vote += 1

    respond_to do |format|
      if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "updated_at" = $1, "vote" = $2 WHERE "questions"."id" = 1  [["updated_at", "2014-12-11 18:54:22.878343"], ["vote", 2]]
---
  def downvote
    @question = Question.find(params[:id])

    @question.vote -= 1
    respond_to do |format|
      if @question.save